//Task1_6  Получить  все  четырехзначные  числа,  в  записи  которых  встречаются только цифры 0,2,3,7.

	$a = 0;
	$b = 2;
	$c = 3;
	$d = 7;
	for($i = $b; $i <= $d; $i++) {
		
		if($i != $b && $i != $c && $i != $d){
			continue;
		}
	
		for($l = $a; $l <= $d; $l++) {
			if(($l != $a && $l != $b && $l != $c && $l != $d) || ($i == $l)){
				continue;
			}
			 				
				for($k = $a; $k <= $d; $k++) {
					if(($k != $a && $k != $b && $k != $c && $k != $d) || ($k == $l || $k == $i)){
						continue;
					}
			
					for($j = $a; $j <= $d; $j++){
						if(($j != $a && $j != $b && $j != $c && $j != $d) || ($j == $l || $j == $i || $j == $k)){
							continue;
						}
						
						echo $i.$l.$k.$j.'<br>';
										
					}
								
				}

		}
			
	}
