//Task 3 28. В  массиве  А(N,M)  элементы  строк,  начинающихся  с  отрицательного элемента,  расположить  в порядке возрастания.  

$a = array(1,    12,   13,   14,   5);
$b = array(-6,    17,   8,    9,    10);
$c = array(-11,   2,   13,   14,   1);
$d = array(16,   7,    1,   11,   2);
$e = array(2,    22,   3,   24,    2);

$arr = array($a, $b, $c, $d, $e);



for($i = 0; $i < count($arr) ; $i++) {  
   
      for($q = 0; $q < count($arr[$i]); $q++) {

          for($l = 0; $l < count($arr[$i]) - 1; $l++) {

              if($arr[$i][$l] > $arr[$i][$l + 1] && $arr[$i][0] < 0){
                    $x = $arr[$i][$l];
                    $arr[$i][$l] = $arr[$i][$l + 1];
                    $arr[$i][$l + 1] = $x;
              }
          }	
    }			
}
