//Task 3 32. Известно,  что  в  каждой  строке  и  каждом  столбце  массива  А(N,N)  имеется единственный отрицательный элемент. Переставить строки массива  так, чтобы отрицательные элементы находились на главной диагонали.  

$a = array(11,   -12,   13,   14,    5);
$b = array(-1,    1,    1,     9,    10);
$c = array(11,    2,    13,   -14,    1);
$d = array(16,    7,     1,    11,   -2);
$e = array(2,    22,    -3,    24,    2);

$arr = array($a, $b, $c, $d, $e);
$arr2 = array();
for($i = 0; $i < count($arr); $i++) {

  	for($q = 0; $q < count($arr[$i]); $q++) {

        if($arr[$i][$q] < 0){
           $arr2[$i] = $q; 
        }
  	}
}

for ($i = 0; $i < count($arr); $i++){

	 	for ($l = $i + 1; $l < count($arr) ; $l++){

        if ($arr2[$i] > $arr2[$l]){

            for ($j = 0; $j < count($arr[$i]); $j++){

                $x = $arr[$i][$j];
                $arr[$i][$j] = $arr[$l][$j];
                $arr[$l][$j] = $x;

                $y = $arr2[$i];
                $arr2[$i] = $arr2[$l];
                $arr2[$l] = $y;
            }

        }	
		}
}	
