// Task2_33. В массиве А(N) положительные элементы расположить в порядке  возрастания,  затем  вставить  в  массив  заданное  положительное  число р ,  сохранив упорядоченность элементов.  

$arr2 = array(12, 2, 32, -4, 5, 88, -98, -19, -28, 33, -41);

$p = 13;

for($j = 0; $j < count($arr2) - 1; $j++) {
    for($i = $j + 1; $i < count($arr2); $i++) {

		if($arr2[$i] < $arr2[$j] && $arr2[$i] > 0 && $arr2[$j] > 0) {
			$x = $arr2[$i];
			$arr2[$i] = $arr2[$j];
			$arr2[$j] = $x;
		}	
 	}	
}
 	$arr2[count($arr2)] = $p;

for($j = 0; $j < count($arr2) - 1; $j++) {
    for($i = $j + 1; $i < count($arr2); $i++) {

		if($arr2[$i] < $arr2[$j] && $arr2[$i] > 0 && $arr2[$j] > 0) {
			$x = $arr2[$i];
			$arr2[$i] = $arr2[$j];
			$arr2[$j] = $x;
		}	
 	}	
}
