//Task2_37. В массиве А(N) нулевые элементы переставить в начало массива,  а остальные расположить в порядке возрастания.

  $arr = array(12, 0, 32, -4, 5, 88, -98, 19, 0, 33, 0);
	for($k = 0; $k < count($arr); $k++){

		for($i = 0; $i < count($arr) - 1 ; $i++){

			if($arr[$i] != 0) {
				$x = $arr[$i + 1];
				$arr[$i + 1] = $arr[$i];
				$arr[$i] = $x;
			}


	 		if($arr[$i] > $arr[$i + 1] && $arr[$i] != 0) {
				$x = $arr[$i];
				$arr[$i] = $arr[$i + 1];
				$arr[$i + 1] = $x;

			}
		}
	}
