
//Task2_38. В массиве А(N) все отрицательные элементы переставить в начало  массива,  расположив  их  по  возрастанию,  а  положительные  -  в  конец,  расположив их по убыванию. 
 

$arr = array(33, -11, 10, 1, -7, 1, 2, -2, 8, 52, -1, 12);

for($k = 0; $k < count($arr); $k++){

		for($i = 0; $i < count($arr) - 1 ; $i++){

			if($arr[$i] > 0){
          $x = $arr[$i + 1];
          $arr[$i + 1] = $arr[$i];
          $arr[$i] = $x;
			}

			if($arr[$i] > $arr[$i + 1] && $arr[$i] < 0 &&  $arr[$i + 1] < 0) {
          $x = $arr[$i + 1];
          $arr[$i + 1] = $arr[$i];
          $arr[$i] = $x;

			}

			if($arr[$i] < $arr[$i + 1] && $arr[$i] > 0 && $arr[$i + 1] > 0) {
          $x = $arr[$i];
          $arr[$i] = $arr[$i + 1];
          $arr[$i + 1] = $x;

			}
			
	}
}
