//Task2_36. В  массиве  А(N)  положительные  элементы  переставить  в  конец  массива и расположить в порядке убывания.  

$arr = array(12, 2, 32, -4, 5, 88, -98, 19, 28, 33, -41);
	for($k = 0; $k < count($arr); $k++){

		for($i = 0; $i < count($arr) - 1 ; $i++){

			if($arr[$i] > 0) {
          $x = $arr[$i + 1];
          $arr[$i + 1] = $arr[$i];
          $arr[$i] = $x;
			}


	 		if($arr[$i] < $arr[$i + 1] && $arr[$i] > 0) {
          $x = $arr[$i];
          $arr[$i] = $arr[$i + 1];
          $arr[$i + 1] = $x;

			}
		}
	}
