//Task2_32. В массиве А(N) расположить все четные элементы в порядке возрастания, а нечетные в порядке убывания.  

$arr = array(33, 11, 11, 1, 7, 1, 2, 2, 8, 52, 1, 12);

for($k = 0; $k < count($arr); $k++){

		for($i = 0; $i < count($arr) - 1 ; $i++){

			if($arr[$i] % 2 == 0){
          $x = $arr[$i + 1];
          $arr[$i + 1] = $arr[$i];
          $arr[$i] = $x;
			}

			if($arr[$i] > $arr[$i + 1] && $arr[$i] % 2 == 0 &&  $arr[$i + 1] % 2 == 0) {
          $x = $arr[$i + 1];
          $arr[$i + 1] = $arr[$i];
          $arr[$i] = $x;

			}

			if($arr[$i] < $arr[$i + 1] && $arr[$i] % 2 != 0 && $arr[$i + 1] % 2 != 0) {
          $x = $arr[$i];
          $arr[$i] = $arr[$i + 1];
          $arr[$i + 1] = $x;

			}			
	}
}
